Tekla.Structures.Model.Material
The Material class represents a single material that parts can be made of.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Beam beam = new Beam(new Point(5000, 7000, 0), new Point(6000, 7000, 0));
beam.Material.MaterialString = "K40-1";
beam.Profile.ProfileString = "250*250";
beam.Finish = "PAINT";
bool result = false;
result = beam.Insert();
}
}

Tekla.Structures.Model.Material.MaterialString
Identifies the material in a string format.

Tekla.Structures.Model.Material.#ctor
Instantiates an empty material instance.